---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Directcontext3dApplicationId
source: html/ab8ff07c-8c34-2c46-92dd-2d93b9c35efb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Directcontext3dApplicationId Property

"ApplicationId"

## Syntax (C#)
```csharp
public static ForgeTypeId Directcontext3dApplicationId { get; }
```